{"pageProps":{"projectName":"FDS Architecture","currentAdr":{"slug":"principles/20230919-p02-grip-op-data","package":"principles","title":"Principe P02: Grip op data","status":"draft","supersededBy":null,"tags":["strategisch_principe","architectuur_principe"],"deciders":["FDS programma"],"body":{"enhancedMdx":"\nIssue: [description | ticket/issue URL] <!-- optional -->\n\n## Context en probleemstelling\n\nEr is veel data binnen de overheid en deze wordt ook nog eens veelvuldig gedeeld en gekopieerd. Het is onduidelijk waar welke data is,\nwat de actualiteit en betrouwbaarheid daarvan is,\nen ook niet waar persoonsgegevens precies bij en voor gebruikt worden.\nHoe kan dit geadresseerd worden?\n\n## Beslissingsfactoren <!-- optional -->\n\n- [Data bij de Bron](#data-bij-de-bron)\n- [Regie op Gegevens](#regie-op-gegevens)\n- FDS & Digilab onderzoek richting Event Sourcing\n- … <!-- numbers of drivers can vary -->\n\n## Overwogen opties\n\n- [Data bij de Bron](#data-bij-de-bron)\n- [Regie op Gegevens](#regie-op-gegevens)\n- [Grip op data](#grip-op-data)\n- … <!-- numbers of options can vary -->\n\n## Besluit\n\nGekozen oplossing: \"Grip op data\", omdat het onderliggende problematiek adresseert om data bij de bron te ondersteunen cq mogelijk te maken en een voorwaarde is om regie op gegevens te kunnen realiseren.\n\n### Positieve gevolgen <!-- optional -->\n\n- ongecontroleerde kopieën van data moeten worden opgeruimd\n- data bij de bron ophalen wordt aangejaagd\n- gecontroleerde kopieën van data worden expliciet gemaakt\n  - hoe is in onderzoek\n- er zal ook grip verkregen moeten worden op historische data (kopieën uit het verleden)\n- bij het vastleggen van besluiten dient ook te worden vastgelegd op welke (kwaliteit van) data dit besluit gebaseerd is; dit biedt ook mogelijkheden om correcties te (gaan) ondersteunen in geval deze data achteraf anders blijkt dan bij het oorspronkelijk besluit\n\n### Negatieve Consequences <!-- optional -->\n\n- snelle en gemakkelijke kopieën van data worden opgeruimd,\n  - waardoor processen mogelijk moeilijker en/of langzamer worden\n  - wat zwaardere afhankelijkheden tussen organisaties op koppelingen legt\n  - data-aanbieders zullen hogere beschikbaarheid en betrouwbaarheid moeten leveren voor hun dataservices\n- systemen zullen (mogelijk?) anders opgebouwd moeten worden\n  - tbv gecontroleerde kopieën\n  - tbv historische data\n\n## Pros en Cons van de oplossingen <!-- optional -->\n\n### Data bij de Bron\n\n**Data bij de bron** is niet ondubbelzinnig duidelijk.\n[Data bij de Bron](https://www.digitaleoverheid.nl/data-bij-de-bron/) wordt als uitgangspunt genoemd bij de Digitale Overheid:\n\n> Data bij de bron is een belangrijk uitgangspunt voor de digitale transformatie van de Nederlandse overheid. Data hoort zo veel mogelijk op één logische plek te staan, bij de eigenaar van die gegevens.\n\nEén logische plek is echter niet zo logisch als een basisregistratie een verzameling is van de 'stukjes' basisregistratie die bij elke gemeente ligt.\nDat is namelijk niet één plek.\nDat is wél de eigenaar.\nMaar wat is er nu belangrijker bij dit uitgangspunt: 'één logische plek' of 'bij de eigenaar van die gegevens'?\n\nOm hier een uitweg in te vinden, worden extra oplossingen ingebracht zoals Landelijke Voorzieningen.\nOp zichzelf zijn deze ook nuttig en van toegevoegde waarde,\nmaar in het kader van data bij de bron zijn deze ingewikkeld.\n\n- Wat is nu de bron?\n- Wie is hier nu eigenaar van?\n- De oorspronkelijke gemeente? Die is in ieder geval niet ontslagen van haar verantwoordelijkheid op de juistheid van de data\n- De uitvoeringsorganisatie? Die is in ieder geval niet direct verantwoordelijkheid voor de juistheid, maar wel weer voor de beschikbaarheid e.d.\n\nDit uitgangspunt levert dan ook weer nieuwe vragen op:\n\n- Wat is 'dé bron'?\n- Is dat altijd hetzelfde vanuit elk perspectief? Of mag dat ook anders zijn vanuit data-aanbieder, bronhouder en data-afnemer?\n\n**FDS overwegingen**\n\n- Goed, omdat het de oorsprong van data en informatie adresseert\n- Goed, omdat het zich richt op waar de verantwoordelijkheid ligt, in ieder geval wat betreft de oorsprong van de data\n- Slecht, omdat geen uitsluitsel geeft over de nieuwe vragen die het opwerkt\n- … <!-- numbers of pros and cons can vary -->\n\n### Regie op Gegevens\n\n[Regie op gegevens](https://www.digitaleoverheid.nl/overzicht-van-alle-onderwerpen/regie-op-gegevens/) is ook een programma van de Digitale Overheid.\nIn dit programma is een voorstudie gedaan naar een [kader voor regie op gegevens](https://rog.pleio.nl/news/view/f0dc6a48-97e1-4102-a656-72e86a811511/voorstudie-naar-een-kader-voor-regie-op-gegevens):\n\n- Hoofdprincipes\n  - _Mens centraal_ \n  - _Digitale autonomie_\n  - _Inclusiviteit_\n- Inrichtingsprincipes \n  - _Vertrouwen_\n  - _Transparantie_\n  - _Interoperabiliteit_\n  - _Dataminimalisatie_\n\nAl deze principes zijn erop gericht om duidelijkheid en grip te kunnen verschaffen aan personen en bedrijven daar waar het over hen gaat.\nDaarvoor is het noodzakelijk om te weten waar welke data is en wordt gebruikt, zeker in geval van persoonsgegevens.\n\n**FDS overwegingen**\n\n- Goed, omdat het aandacht vraagt voor [verantwoord datagebruik](./20230915-P01-verantwoord-datagebruik.md)\n- Goed, omdat het (indirect) vraagt naar _grip op data_\n- Slecht, omdat het 'slechts' _indirect_ vraagt naar _grip op data_ en niet expliciet; het stelt meer een voorwaarde van _grip op data_\n- … <!-- numbers of pros and cons can vary -->\n\n### Grip op data\n\nIn een federatief datastelsel mag het niet zo zijn dat er 'onbekende' databronnen zijn.\nVan _alle_ data is bekend waar deze ontstaan is.\nVan _alle_ data is bekend waar deze vandaan komt.\nVan _alle_ data is bekend waar deze gebruikt wordt.\nOp _alle_ data is _grip_.\nDus: _grip op data_.\n\nAfgeleide en/of gevolgen daarvan zijn, dat er regie op gegevens gedaan kan worden.\nEn _minder_ data betekent gemakkelijker en sneller _grip_.\nDus zo min mogelijk kopieën van data en als er wel kopieën zijn,\ndan zijn deze expliciet inclusief de voorzieningen om actualiteit, traceerbaarheid en gebruik te volgen.\n\n- Goed, omdat het de kern raakt of voorwaarde is om regie op gegevens te kunnen doen\n- Goed, omdat het onbekende en onbeheerde kopieën van data tegengaat, zoals data bij de bron tracht te bereiken\n- Goed, omdat het een meer onderliggende basis legt zodat data bij de bron beter of anders bereikt kan worden\n- … <!-- numbers of pros and cons can vary -->\n\n## Links <!-- optional -->\n\n- [Link naam](link to adr) <!-- example: Refined by [xxx](yyyymmdd-xxx.md) -->\n- … <!-- numbers of links can vary -->\n"},"creationDate":"2023-09-19T15:31:21.000Z","lastEditDate":"2023-09-22T13:54:44.000Z","lastEditAuthor":"Marc van Andel","publicationDate":null,"file":{"relativePath":"packages/principles/adr/20230919-p02-grip-op-data.md","absolutePath":"/home/runner/work/fds-architecture/fds-architecture/packages/principles/adr/20230919-p02-grip-op-data.md"},"repository":{"provider":"github","viewUrl":"https://github.com/marcvanandel/fds-architecture/blob/master/packages/principles/adr/20230919-p02-grip-op-data.md"}},"l4bVersion":"1.0.1"},"__N_SSG":true}