{"pageProps":{"projectName":"FDS Architecture","currentAdr":{"slug":"architecture/20230914-gebruik-van-markdown-architectural-decision-records","package":"architecture","title":"Gebruik van Markdown Architectural Decision Records","status":"proposed","supersededBy":null,"tags":["doc"],"deciders":[],"body":{"enhancedMdx":"\n## Context en probleemstelling\n\nWij willen ontwerpbeslissingen en architectuurbesluiten vastleggen voor dit project.\nWelke formaat en structuur zouden we willen gebruiken voor het vastleggen van deze beslissingen?\n\n## Overwogen opties\n\n- [NORA Wiki](https://www.noraonline.nl/wiki/NORA_online)\n- [MADR](https://adr.github.io/madr/) 2.1.2 with Log4brains patch\n- [MADR](https://adr.github.io/madr/) 2.1.2 – The original Markdown Architectural Decision Records\n- [Michael Nygard's template](http://thinkrelevance.com/blog/2011/11/15/documenting-architecture-decisions) – The first incarnation of the term \"ADR\"\n- [Sustainable Architectural Decisions](https://www.infoq.com/articles/sustainable-architectural-design-decisions) – The Y-Statements\n- Other templates listed at <https://github.com/joelparkerhenderson/architecture_decision_record>\n- Formless – No conventions for file format and structure\n\n## Besluit\n\nGekozen oplossing: \"MADR 2.1.2 with Log4brains patch\", omdat:\n\n- Markdown een bredere (de facto) standaard is dan Mediawiki\n- Markdown i.c.m. Git meer versiebeheer mogelijkheden heeft\n- Markdown meer mogelijkheden voor publicatie heeft door de rijke selectie aan tools die beschikbaar; het is zelfs mogelijk om vanuit één collectie Markdown bestanden meerdere publicaties te doen (misschien zinnig voor verschillende perspectieven en/of communities om te publiceren?)\n- Implicit assumptions should be made explicit.\n  Design documentation is important to enable people understanding the decisions later on.\n  See also [A rational design process: How and why to fake it](https://doi.org/10.1109/TSE.1986.6312940).\n- The MADR format is lean and fits our development style.\n- The MADR structure is comprehensible and facilitates usage & maintenance.\n- The MADR project is vivid.\n- Version 2.1.2 is the latest one available when starting to document ADRs.\n- The Log4brains patch adds more features, like tags.\n\nThe \"Log4brains patch\" performs the following modifications to the original template:\n\n- Change the ADR filenames format (`NNN-adr-name` becomes `YYYYMMDD-adr-name`), to avoid conflicts during Git merges.\n- Add a `draft` status, to enable collaborative writing.\n- Add a `Tags` field.\n\n### Positieve gevolgen <!-- optional -->\n\n- Invulling van NORA implicatie [Maak besluiten traceerbaar en controleerbaar](https://www.noraonline.nl/wiki/Maak_besluiten_traceerbaar_en_controleerbaar) en het bovenliggende principe [Geef inzicht in de afhandeling van de dienst](https://www.noraonline.nl/wiki/Geef_inzicht_in_de_afhandeling_van_de_dienst)\n- …\n\n### Negatieve Consequences <!-- optional -->\n\n- Gebruikers en 'contributors' hebben kennis en ervaring van Git(Hub) en Markdown nodig\n\n## Pros en Cons van de oplossingen <!-- optional -->\n\n### NORA Wiki\n\nEen wiki is een manier om online content te publiceren én tegelijk dat te beheren met meerdere mensen.\nHet biedt de mogelijkheid om door content te bladeren, te zoeken en links tussen pagina's te maken.\nEen 'What You See Is What You Get' (WYSIWYG) editor ondersteunt niet-technische gebruikers.\nDit is waar [Wikipedia](https://www.wikipedia.org/) mee ontstaan en groot geworden is.\n\nDe Nederlandse Overheids Referentie Architectuur, NORA, maakt gebruik van dezelfde technologie als Wikipedia: [Mediawiki](https://www.mediawiki.org/wiki/MediaWiki).\nHet doel is vergelijkbaar als met Wikipedia, namelijk dat het beheer van content eenvoudig is en door iedereen gedaan kan worden.\n\n- Goed, omdat gepubliceerde content en het wijzigen van content dicht bij elkaar staan en te vinden zijn\n- Goed, omdat niet-technische gebruikers gemakkelijk kunnen bijdragen (na aanmaken van een account, dat zelfstandig gedaan kan worden)\n- Slecht, omdat versiebeheer per pagina niet zo duidelijk is\n- Slecht, omdat versiebeheer van meerdere en samenhangende pagina's eigenlijk niet goed ondersteund worden (er zijn wel wat mogelijkheden ... maar allemaal suboptimaal)\n- Vergelijkbaar met Markdown, omdat het onderliggende formaat waarmee een wiki werkt, ondanks de WYSIWYG editor, gebaseerd is op 'wikitekst'.\n  Dat is de facto standaard van Mediawiki en lijkt op Markdown.\n  Wikitekst is minder gestandaardiseerd dan Markdown en alleen (in deze vorm) ondersteund door Mediawiki.\n\n### Markdown in enige vorm\n\nBij de ontwikkeling van content, het zij op internet, het zij in documenten, is er behoefte aan opmaak.\nOpmaak in Microsoft Word is specifiek en direct afhankelijk van de tool MS Word.\nOp internet is de afhankelijkheid naar een tool er niet.\nHoogstens van de HTML (+ CSS + JavaScript) standaarden voor visualisatie mogelijkheden.\n\nOm voor de ontwikkeling van content op internet niet afhankelijk te zijn van technische experts die HTML+ kunnen schrijven,\nwordt er al lang gezocht naar manieren om met 'pseudo codes' opmaak aan te geven in platte tekst.\nWikitekst, zoals in de [NORA Wiki](#nora-wiki), is daar een voorbeeld van.\nHet vroegere Wordperfect had daar ook mogelijkheden voor.\nVoor software documentatie is Markdown de de facto standaard.\n\nMarkdown is een vrij eenvoudige specificatie van speciale codes die opmaak betekenis hebben.\nDoor een conversiestap van bron (source) document naar HTML kan een mooie HTML website gepubliceerd worden.\nDoordat Markdown redelijk gestandaardiseerd is, zijn er vele (😳) tools beschikbaar die een website kunnen genereren.\nHier is enorme keuze om een geschikte tool te vinden afhankelijk van de situatie.\n\nDoordat Markdown bestanden platte tekst bestanden zijn, is versiebeheer mbv Git makkelijk, logisch en veel toegepast.\nDaarom is dit ook een prettige oplossing voor software developers documentatie.\nTools als GitHub en GitLab hebben standaard ook ondersteuning voor Markdown incl. presentatie als HTML.\n\n- Goed, omdat Markdown eenvoudige codes gebruikt, zodat ook minder-technische mensen er mee uit de voeten kunnen\n- Goed, omdat Markdown redelijk gestandaardiseerd is\n- Goed, omdat versiebeheer per Markdown bestand zeer mogelijk is mbv Git\n- Goed, omdat versiebeheer over een collectie Markdown bestanden ook zeer mogelijk is door de toepassing van Git\n- Goed, omdat de brondocumenten in Markdown echt ontkoppeld zijn van de tool voor publicatie in HTML\n- Slecht, omdat de brondocumenten op enige afstand kunnen staan door de ontkoppeling met de publicatie tool\n- Slecht, omdat het versiebeheer geen onderdeel is van Markdown en extra toegevoegd moet worden. Git is daarvoor zeer geschikt ... maar ook zo uitgebreid, dat minder-technische mensen daar moeite mee hebben. Dit verhoogt de barrière voor minder-technische mensen om Markdown (plus Git) te gebruiken\n- Vergelijkbaar met Wikitekst, omdat het platte tekst is waarin met codes opmaak wordt geproduceerd\n\n## Links <!-- optional -->\n\n- Gerelateerd aan [Gebruik maken van Log4brains voor het beheer van ADRs](./20230915-gebruik-maken-van-log4brains-voor-het-beheer-van-adrs.md)\n- [Markdown Guide](https://www.markdownguide.org/)\n- [Markdown meest officiële specificatie - on Daring Fireball](https://daringfireball.net/projects/markdown/)\n"},"creationDate":"2023-09-15T11:35:25.000Z","lastEditDate":"2023-09-15T11:35:25.000Z","lastEditAuthor":"Marc van Andel","publicationDate":"2023-09-13T21:59:59.000Z","file":{"relativePath":"packages/architecture/adr/20230914-gebruik-van-markdown-architectural-decision-records.md","absolutePath":"/home/runner/work/fds-architecture/fds-architecture/packages/architecture/adr/20230914-gebruik-van-markdown-architectural-decision-records.md"},"repository":{"provider":"github","viewUrl":"https://github.com/marcvanandel/fds-architecture/blob/master/packages/architecture/adr/20230914-gebruik-van-markdown-architectural-decision-records.md"}},"l4bVersion":"1.0.1"},"__N_SSG":true}